In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
print(os.getcwd())

/home/poshan/Documents/moveiLens/code

In [3]:
base = r"/home/poshan/Documents/moveiLens/data"
os.chdir(base)

In [4]:
df = pd.read_csv('titanic.csv', sep = ',')
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

## Avareage

In [5]:
df.mean()

Survived                    0.385569
Pclass                      2.305524
Age                        29.471443
Siblings/Spouses Aboard     0.525366
Parents/Children Aboard     0.383315
Fare                       32.305420
dtype: float64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

## Columns

In [7]:
for col in df.columns: 
    print(col)

Survived
Pclass
Name
Sex
Age
Siblings/Spouses Aboard
Parents/Children Aboard
Fare

In [8]:
df.shape

(887, 8)

In [16]:
pd.pivot_table(df, values='Age',
                    columns='Sex')

Sex     female       male
Age  27.719745  30.431361

In [17]:
pd.pivot_table(df, values='Pclass',
                    columns='Sex')

Sex       female      male
Pclass  2.159236  2.385689

In [18]:
pd.pivot_table(df, values='Survived',
                    columns='Sex')

Sex         female      male
Survived  0.742038  0.190227

In [12]:
df1 = pd.pivot_table(df, index = ["Sex","Age","Pclass"], aggfunc=np.sum)
df1.head()

                        Fare  Parents/Children Aboard  \
Sex    Age  Pclass
female 0.75 3        38.5166                        2
       1.00 3        26.8750                        3
       2.00 1       151.5500                        2
            2        26.0000                        1
            3       104.2833                        7

                    Siblings/Spouses Aboard  Survived
Sex    Age  Pclass
female 0.75 3                             4         2
       1.00 3                             1         2
       2.00 1                             1         0
            2                             1         1
            3                             8         2

In [13]:
result = pd.cut(df['Age'], [0,10, 18, 40, 70])
result

0      (18, 40]
1      (18, 40]
2      (18, 40]
3      (18, 40]
4      (18, 40]
         ...
882    (18, 40]
883    (18, 40]
884     (0, 10]
885    (18, 40]
886    (18, 40]
Name: Age, Length: 887, dtype: category
Categories (4, interval[int64]): [(0, 10] < (10, 18] < (18, 40] < (40, 70]]

In [14]:
df2 = df[df['Age'] > 18].groupby('Sex')['Siblings/Spouses Aboard','Parents/Children Aboard'].count()
df2

/home/poshan/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

        Siblings/Spouses Aboard  Parents/Children Aboard
Sex
female                      234                      234
male                        487                      487